Repository: hazre/MaterialShaderReplacer
Catalog: Packages/dev.hazre.materialshaderreplacer/Localization/*.po
Languages: de_de, ja_jp

# MaterialShaderReplacer:Window:Title
source: Material Shader Replacer
de_de: Material-Shader-Ersetzer

# MaterialShaderReplacer:Error:ReflectionInitFailed
source: ShaderReplacerTool: Reflection initialization failed. Using basic fields. Error:
de_de: ShaderReplacerTool: Initialisierung der Reflection fehlgeschlagen. Verwende Basis-Felder. Fehler:
ja_jp: Shader Replacer Tool: リフレクションの初期化に失敗しました。基本フィールドを使用します。エラー:

# MaterialShaderReplacer:Error:ReflectionNotReady
source: Reflection not ready for shader dropdown.
de_de: Reflection nicht bereit für Shader-Dropdown.
ja_jp: シェーダーのドロップダウンに対してリフレクションの準備ができていません。

# MaterialShaderReplacer:Error:ShowShaderDropdownFailed
source: Error showing reflected shader dropdown:
de_de: Fehler beim Anzeigen des reflektierten Shader-Dropdowns:
ja_jp: リフレクションされたシェーダーのドロップダウン表示エラー:

# MaterialShaderReplacer:Label:SourceShader
source: Source Shader
de_de: Quell-Shader
ja_jp: 変換元シェーダー

# MaterialShaderReplacer:Label:TargetShader
source: Target Shader
de_de: Ziel-Shader
ja_jp: 変換先シェーダー

# MaterialShaderReplacer:HelpBox:BackupProject
source: Replaces shaders on materials. Always back up your project first!
de_de: Ersetzt Shader auf Materialien. Erstellen Sie immer zuerst ein Backup Ihres Projekts!
ja_jp: マテリアルのシェーダーを置換します。最初に必ずプロジェクトをバックアップしてください！

# MaterialShaderReplacer:Label:ProcessingScope
source: Processing Scope
de_de: Verarbeitungsbereich
ja_jp: 処理範囲

# MaterialShaderReplacer:Label:Scope
source: Scope
de_de: Bereich
ja_jp: 範囲

# MaterialShaderReplacer:Label:ShaderSelection
source: Shader Selection
de_de: Shader-Auswahl
ja_jp: シェーダー選択

# MaterialShaderReplacer:HelpBox:AdvancedDropdownFailed
source: Advanced shader dropdown failed. Using basic ObjectFields.
de_de: Erweitertes Shader-Dropdown fehlgeschlagen. Verwende einfache ObjectFields.
ja_jp: 高度なシェーダーのドロップダウンに失敗しました。基本的なオブジェクトフィールドを使用します。

# MaterialShaderReplacer:Label:GameObjectExclusionFilter
source: GameObject Exclusion Filter
de_de: GameObject-Ausschlussfilter
ja_jp: GameObject除外フィルター

# MaterialShaderReplacer:Label:ExcludedGameObjects
source: Excluded GameObjects
de_de: Ausgeschlossene GameObjects
ja_jp: 除外されたGameObject

# MaterialShaderReplacer:HelpBox:ExclusionFilterDisabled
source: Exclusion filter is disabled for 'Entire Project' scope. It primarily affects 'GameObject And Children' scope.
de_de: Ausschlussfilter ist für den Bereich 'Gesamtes Projekt' deaktiviert. Er betrifft hauptsächlich den Bereich 'GameObject und Kinder'.
ja_jp: 除外フィルターは「プロジェクト全体」の範囲では無効です。主に「GameObjectとその子」の範囲に影響します。

# MaterialShaderReplacer:Button:ReplaceShaders
source: Replace Shaders
de_de: Shader ersetzen
ja_jp: シェーダーを置換

# MaterialShaderReplacer:Dialog:ConfirmReplacement:Title
source: Confirm Shader Replacement
de_de: Shader-Ersetzung bestätigen
ja_jp: シェーダー置換の確認

# MaterialShaderReplacer:Dialog:ConfirmReplacement:QueryFormat
source: Are you sure you want to replace all materials using '{0}' with '{1}' {2}?
de_de: Sind Sie sicher, dass Sie alle Materialien, die '{0}' verwenden, durch '{1}' {2} ersetzen möchten?
ja_jp: {2}、'{0}' を使用している全てのマテリアルを '{1}' に置換してもよろしいですか？

# MaterialShaderReplacer:Dialog:ConfirmReplacement:ScopeProject
source: in the entire project
de_de: im gesamten Projekt
ja_jp: プロジェクト全体で

# MaterialShaderReplacer:Dialog:ConfirmReplacement:ScopeGameObjectFormat
source: under '{0}'
de_de: unter '{0}'
ja_jp: '{0}' (およびその子) の範囲で

# MaterialShaderReplacer:Text:UnassignedRoot
source: Unassigned Root
de_de: Nicht zugewiesenes Root
ja_jp: 未割り当てのルート

# MaterialShaderReplacer:Dialog:ConfirmReplacement:Warning
source: This action can be undone for assets, but scene changes need scene undo/revert. BACKUP YOUR PROJECT.
de_de: Diese Aktion kann für Assets rückgängig gemacht werden, aber Szenenänderungen erfordern Szenen-Undo/Zurücksetzen. SICHERN SIE IHR PROJEKT.
ja_jp: この操作はアセットに対して元に戻すことができますが、シーンの変更はシーンを元に戻す必要があります。プロジェクトをバックアップしてください。

# MaterialShaderReplacer:Button:YesReplace
source: Yes, Replace
de_de: Ja, ersetzen
ja_jp: 置換する

# MaterialShaderReplacer:Button:Cancel
source: Cancel
de_de: Abbrechen
ja_jp: キャンセル

# MaterialShaderReplacer:Label:LogChangedMaterials
source: Log of Changed Materials:
de_de: Protokoll der geänderten Materialien:
ja_jp: 変更されたマテリアルのログ:

# MaterialShaderReplacer:Label:NoMaterialsChanged
source: No materials changed yet.
de_de: Noch keine Materialien geändert.
ja_jp: まだ変更されたマテリアルはありません。

# MaterialShaderReplacer:Text:None
source: (None)
de_de: (Keine)
ja_jp: (なし)

# MaterialShaderReplacer:Dialog:Error:Title
source: Error
de_de: Fehler
ja_jp: エラー

# MaterialShaderReplacer:Dialog:Error:SourceShaderMissing
source: Source Shader not selected!
de_de: Quell-Shader nicht ausgewählt!
ja_jp: 変換元シェーダーが選択されていません！

# MaterialShaderReplacer:Dialog:Error:TargetShaderMissing
source: Target Shader not selected!
de_de: Ziel-Shader nicht ausgewählt!
ja_jp: 変換先シェーダーが選択されていません！

# MaterialShaderReplacer:Dialog:Error:ShadersSame
source: Source and Target shaders are the same!
de_de: Quell- und Ziel-Shader sind identisch!
ja_jp: 変換元シェーダーと変換先シェーダーが同じです！

# MaterialShaderReplacer:Dialog:Error:RootGameObjectMissing
source: Root GameObject not selected for the current scope!
de_de: Root-GameObject für den aktuellen Bereich nicht ausgewählt!
ja_jp: 現在の範囲に対してルートGameObjectが選択されていません！

# MaterialShaderReplacer:Message:ScenesModifiedFormat
source: {0} scene(s) were modified. Remember to save them.
de_de: {0} Szene(n) wurde(n) geändert. Denken Sie daran, sie zu speichern.
ja_jp: {0} 個のシーンが変更されました。忘れずに保存してください。

# MaterialShaderReplacer:Dialog:Success:Title
source: Success
de_de: Erfolg
ja_jp: 成功

# MaterialShaderReplacer:Dialog:Success:MessageFormat
source: Successfully changed shader on {0} material instance(s).{1} Check the log in the tool window.
de_de: Shader erfolgreich bei {0} Materialinstanz(en) geändert.{1} Überprüfen Sie das Protokoll im Tool-Fenster.
ja_jp: {0} 個のマテリアルインスタンスのシェーダーを正常に変更しました。{1} ツールウィンドウのログを確認してください。

# MaterialShaderReplacer:Dialog:NoChanges:Title
source: No Changes
de_de: Keine Änderungen
ja_jp: 変更なし

# MaterialShaderReplacer:Dialog:NoChanges:Message
source: No materials found matching the criteria, or operation was cancelled.
de_de: Keine Materialien gefunden, die den Kriterien entsprechen, oder der Vorgang wurde abgebrochen.
ja_jp: 条件に一致するマテリアルが見つからないか、操作がキャンセルされました。

# MaterialShaderReplacer:ProgressBar:ReplacingProject:Title
source: Replacing Shaders (Project)
de_de: Shader ersetzen (Projekt)
ja_jp: シェーダーを置換中 (プロジェクト)

# MaterialShaderReplacer:ProgressBar:ProcessingAsset:Format
source: Processing Asset: {0}
de_de: Verarbeite Asset: {0}
ja_jp: アセットを処理中: {0}

# MaterialShaderReplacer:Text:Unknown
source: Unknown
de_de: Unbekannt
ja_jp: 不明

# MaterialShaderReplacer:Log:OperationCancelledByUser
source: Operation cancelled by user.
de_de: Vorgang vom Benutzer abgebrochen.
ja_jp: ユーザーによって操作がキャンセルされました。

# MaterialShaderReplacer:Undo:ChangeShaderAsset
source: Change Shader on Asset
de_de: Shader auf Asset ändern
ja_jp: アセットのシェーダーを変更

# MaterialShaderReplacer:Log:ChangedAsset:Format
source: Changed ASSET: {0} (Shader: {1} -> {2})
de_de: ASSET geändert: {0} (Shader: {1} -> {2})
ja_jp: アセット変更: {0} (シェーダー: {1} -> {2})

# MaterialShaderReplacer:ProgressBar:ReplacingGameObject:Title
source: Replacing Shaders (GameObject Scope)
de_de: Shader ersetzen (GameObject-Bereich)
ja_jp: シェーダーを置換中 (GameObject範囲)

# MaterialShaderReplacer:ProgressBar:ProcessingRenderer:Format
source: Processing Renderer: {0}
de_de: Verarbeite Renderer: {0}
ja_jp: レンダラーを処理中: {0}

# MaterialShaderReplacer:Log:SkippedExcluded:Format
source: SKIPPED (Excluded): {0}
de_de: ÜBERSPRUNGEN (Ausgeschlossen): {0}
ja_jp: スキップ (除外): {0}

# MaterialShaderReplacer:Undo:ChangeShaderInstanceOrAsset
source: Change Shader on Material Instance/Asset
de_de: Shader auf Materialinstanz/Asset ändern
ja_jp: マテリアルインスタンス/アセットのシェーダーを変更

# MaterialShaderReplacer:Log:ChangedOnGameObject:Format
source: Changed on '{0}' (Material: {1}, Index: {2}): {3} -> {4}
de_de: Geändert bei '{0}' (Material: {1}, Index: {2}): {3} -> {4}
ja_jp: '{0}' 上で変更 (マテリアル: {1}, インデックス: {2}): {3} -> {4}

# MaterialShaderReplacer:Enum:ProcessingScope:EntireProject
source: Entire Project
de_de: Gesamtes Projekt
ja_jp: プロジェクト全体

# MaterialShaderReplacer:Enum:ProcessingScope:GameObjectAndChildren
source: GameObject And Children
de_de: GameObject und Kinder
ja_jp: ゲームオブジェクトとその子

# MaterialShaderReplacer:Label:RootGameObject
source: Root GameObject
ja_jp: ルートGameObject
